IdeaRS.OpenModel.Model.SubStructureGeometry
SubStructureGeometry

IdeaRS.OpenModel.Model.SubStructureGeometry.#ctor
Constructor

IdeaRS.OpenModel.Model.SubStructureGeometry.ConnectionPoints
Array of connection points
Returns: List of ConnectionPoints

IdeaRS.OpenModel.Model.SubStructureGeometry.RealMembers
Array of DesignMemberInSubStructure
Returns: List of DesignMemberInSubStructure

IdeaRS.OpenModel.Model.SubStructureGeometry.TheoreticalMembers
Array of DesignMemberInSubStructure
Returns: List of DesignMemberInSubStructure